zigzeg/app/controllers/listings_controller.rb

SELECT COUNT(*) FROM `listings` WHERE (status=1 AND (name like '%%' OR description like '%%' OR tags like '%%' OR extra_info like '%%' OR gallery_title like '%%' OR gallery_description like '%%' OR shouts like '%%' ))
SELECT `categories`.* FROM `categories` WHERE (code <> 'others' AND parent_id IS NULL) ORDER BY name ASC
SELECT `listings`.* FROM `listings` WHERE (status=1 AND (name like '%%' OR description like '%%' OR tags like '%%' OR extra_info like '%%' OR gallery_title like '%%' OR gallery_description like '%%' OR shouts like '%%' )) ORDER BY ranking DESC, id DESC, published_at DESC LIMIT 15 OFFSET 0
---
  def index
    unless params[:search].blank?
      params[:search] = params[:search].gsub("Search...", "")
    end

    catids = params[:category] || nil
    @listings = Listing.get(params[:page], params[:search],
                { :type => params[:type],
                  :categories => params[:category],
                  :per_page => Constant::PER_PAGE,
                  :bytime => (params[:time] rescue nil)
                })