zigzeg/app/controllers/places_controller.rb

SELECT `places`.* FROM `places` WHERE `places`.`page_code` = 'system/images/23/super_thumb/1329479603-6714071979_4aa75a398a.jpg' LIMIT 1
---
  def show
    @place = Place.find_by_page_code(params[:name])